// Напишіть функцію, яка приймає:
// 1) Деякі дані умовного типу Т, але не з усіма полями
// 2) функцію-доповнювач, яка приймає такі штуки як із п.1,
//     а повертає повноцінний об'єкт типу Т
// ... як ви зрозуміли, саму функцію писати не треба:)
// нас цікавить лише її сигнатура.
function someFunc(obj, func) { }
// Більш складний варіант:
// Напишіть функцію, яка приймає:
// 1) Деякі дані умовного типу Т (у якого поле id: string),
//    але можливо без поля id
// 2) функцію-доповнювач, яка приймає такі штуки як із п.1,
//     а повертає повноцінний об'єкт типу Т
// ... як ви зрозуміли, саму функцію писати не треба:)
// нас цікавить лише її сигнатура.
function someFunc2(obj, func) { }
// Останнє завдання:
// Напишіть сигнатуру функції, що приймає
// - якийсь клас
// - кількість
// ...а повертає масив екземплярів цього класу
var Rectangle = /** @class */ (function () {
    function Rectangle() {
    }
    return Rectangle;
}());
var Circle = /** @class */ (function () {
    function Circle() {
    }
    return Circle;
}());
// Зробіть норм сигнатуру тут.
// НІ, Rectangle | Circle це не варіант, треба зробити універсальну функцію
function replicate(SOMECLASS, count) {
    var a = [];
    for (var i = 0; i < count; i++)
        a.push(new SOMECLASS());
    return a;
}
var a = replicate(Rectangle, 10);
var b = replicate(Circle, 20);
console.log(a);
